[
    {
        "title": "Commercial Network Engineer II",
        "company": "Sparklight",
        "location": "Remote",
        "time": "September 2025 - Present",
        "featured": true,
        "description": "Spearheading advanced network design and service deployment for enterprise clients. Leading strategic initiatives to optimize service activation workflows and elevate customer satisfaction through technical excellence."
    },
    {
        "title": "Commercial Network Engineer I",
        "company": "Sparklight",
        "location": "Remote",
        "time": "June 2024 - August 2025",
        "featured": true,
        "description": "Orchestrated the end-to-end design, deployment, and validation of DIA, EPL, and Cellular Backhaul services. Proactively resolved network constraints to enable multi-gigabit delivery and led a company-wide initiative for Active Ethernet CPE deployment."
    },
    {
        "title": "Service Activation Technician III",
        "company": "Cable One",
        "location": "Remote",
        "featured": true,
        "description": "Directed the activation of mission-critical Ethernet and Cellular Backhaul services while maintaining rigorous performance standards. Developed automation scripts for CPE configuration, significantly accelerating deployment timelines.",
        "time": "April 2023 - June 2024"
    },
    {
        "title": "Service Activation Technician II",
        "company": "Cable One",
        "location": "Hybrid Remote",
        "featured": false,
        "description": "Led the Activation team and collaborated across departments to streamline Active Ethernet deployments and MACD workflows. Standardized technical documentation for activation protocols to ensure operational consistency.",
        "time": "July 2020 - April 2023"
    },
    {
        "title": "Service Activation Technician I",
        "company": "Hargray",
        "location": "Pritchardville, SC",
        "featured": false,
        "description": "Managed the activation and lifecycle (MACD) of PON, HFC, and SIP services with a focus on reliability. Played a key role in troubleshooting complex service issues to ensure customer success.",
        "time": "May 2017 - July 2020"
    },
    {
        "title": "IT - Helpdesk Technician",
        "company": "Hargray",
        "location": "Hilton Head, SC",
        "featured": false,
        "description": "Provided comprehensive technical support for internal staff, managing end-to-end employee onboarding and hardware/software lifecycles. Efficiently resolved service tickets to maintain enterprise productivity.",
        "time": "February 2016 - May 2017"
    },
    {
        "title": "TAC Support Technician",
        "company": "Hargray",
        "location": "Bluffton, SC",
        "featured": false,
        "description": "Delivered remote technical support for residential triple-play services, resolving complex connectivity issues while educating users on system functionality.",
        "time": "May 2014 - February 2016"
    }
]